
## Plan Result (aat)




<pre><code>Plan: 1 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.et_acas_subscription_secondary_key
* Update
  * azurerm_api_management_subscription.et_acas_subscription
  * azurerm_api_management_user.et_api_management_user


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_api_management_subscription.et_acas_subscription will be updated in-place
  ~ resource "azurerm_api_management_subscription" "et_acas_subscription" {
      ~ allow_tracing       = false -> true
        id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.ApiManagement/service/cft-api-mgmt-stg/subscriptions/d0d6a8b1-af3a-458e-86c2-29fabc413001"
        # (10 unchanged attributes hidden)
    }

  # azurerm_api_management_user.et_api_management_user will be updated in-place
  ~ resource "azurerm_api_management_user" "et_api_management_user" {
      ~ email               = "Peter.Moores@hmcts.net" -> "Harpreet.Jhita@justice.gov.uk"
      ~ first_name          = "Peter" -> "Harpreet"
        id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.ApiManagement/service/cft-api-mgmt-stg/users/5931a75ae4bbd512288c888c"
      ~ last_name           = "Moores" -> "Jhita"
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.et_acas_subscription_secondary_key will be created
  + resource "azurerm_key_vault_secret" "et_acas_subscription_secondary_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-sya-api-aat/providers/Microsoft.KeyVault/vaults/et-sya-api-aat"
      + name                    = "etacas-subscription-secondary-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

Plan: 1 to add, 2 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":1276,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->